---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralAnalyticalTessellate
source: html/ef50255b-209e-3869-b026-4d2e7d9741c8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralAnalyticalTessellate Property

"Approximate curve"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralAnalyticalTessellate { get; }
```